shop-clothes/app/Http/Controllers/HomeController.php

    public function __invoke(): View
    {
        // Latest products (8 items) - ordered by creation date
        $newProducts = Product::where('is_active', true)
            ->with(['category', 'images', 'variants.color', 'reviews'])
            ->latest('created_at')
            ->limit(8)
            ->get();

        // Best sellers (8 items) - ordered by sales count
        $bestSellers = Product::where('is_active', true)
            ->withCount('orderItems as orders_count')
            ->orderByDesc('orders_count')
            ->with(['category', 'images', 'variants.color', 'reviews'])
            ->limit(8)
            ->get();

        // Advertising banner for middle section
        $adBanner = Banner::where('is_active', true)
            ->where('position', 'middle')
            ->orderBy('sort_order')
            ->first();

        // Featured brands (6 items)
        $brands = Brand::where('is_active', true)
            ->limit(6)
            ->orderBy('name')
            ->get();
---
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6)
select * from `colors` where `colors`.`id` in (1, 2, 3, 4)
select * from `products` where `is_active` = 1 order by `created_at` desc limit 8
select * from `reviews` where `reviews`.`product_id` in (4, 5, 6, 7, 8, 9, 10)
select `products`.*, (select count(*) from `order_items` inner join `product_variants` on `product_variants`.`id` = `order_items`.`product_variant_id` where `products`.`id` = `product_variants`.`product_id`) as `orders_count` from `products` where `is_active` = 1 order by `orders_count` desc limit 8
select * from `banners` where `is_active` = 1 and `position` = 'middle' order by `sort_order` asc limit 1
select * from `brands` where `is_active` = 1 order by `name` asc limit 6

    private function getTestimonials(): array
    {
        // Try to get testimonials from product reviews
        $reviews = Product::where('is_active', true)
            ->with('reviews.user')
            ->get()
            ->flatMap(fn($product) => $product->reviews?->flatten() ?? [])
            ->filter(fn($review) => $review->rating >= 4) // Only positive reviews
            ->unique('user_id')
            ->take(4)
            ->map(fn($review) => [
                'id' => $review->id ?? null,
                'name' => $review->user?->name ?? 'Khách hàng',
                'rating' => $review->rating ?? 5,
                'text' => $review->comment ?? 'Sản phẩm tuyệt vời!',
                'avatar' => ['👨', '👩', '🧑'][rand(0, 2)],
            ])
            ->values()
            ->toArray();
---
select * from `products` where `is_active` = 1
select * from `reviews` where `reviews`.`product_id` in (4, 5, 6, 7, 8, 9, 10)