shop-clothes/app/Http/Controllers/Admin/AdminCouponController.php

select * from `coupons` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `coupons`
---
    public function index(): View
    {
        $coupons = Coupon::latest('id')->paginate(15);