shop-clothes/app/Http/Controllers/Admin/AdminProductController.php

select * from `sizes` order by `id` asc
select * from `colors` order by `name` asc
---
    public function create(): View
    {
        return view('admin.products.create', [
            'product' => new Product(),
            'categoryOptions' => $this->buildCategoryOptions(),
            'brands' => Brand::active()->orderBy('name')->get(),
            'sizes' => Size::orderBy('id')->get(),
            'colors' => Color::orderBy('name')->get(),

insert into `products` (`name`, `slug`, `description`, `short_description`, `category_id`, `brand_id`, `price`, `sale_price`, `sku`, `is_featured`, `is_active`, `meta_title`, `meta_description`, `updated_at`, `created_at`) values ('Thanh xinh gái', 'thanh-xinh-gai', null, null, '1', '1', '900000', '800000', 'Thankiu', 1, 1, null, null, '2026-04-12 17:31:29', '2026-04-12 17:31:29')
---
    public function store(StoreProductRequest $request): RedirectResponse
    {
        DB::transaction(function () use ($request) {
            $data = $request->validated();

            $product = Product::create([
                'name' => $data['name'],
                'slug' => $data['slug'] ?: Str::slug($data['name']) . '-' . Str::lower(Str::random(4)),
                'description' => $data['description'] ?? null,
                'short_description' => $data['short_description'] ?? null,
                'category_id' => $data['category_id'],
                'brand_id' => $data['brand_id'],
                'price' => $data['price'],
                'sale_price' => $data['sale_price'] ?? null,
                'sku' => $data['sku'] ?: $this->generateSku($data['name']),
                'is_featured' => $data['is_featured'],
                'is_active' => $data['is_active'],
                'meta_title' => $data['meta_title'] ?? null,
                'meta_description' => $data['meta_description'] ?? null,
            ]);

select * from `sizes` order by `id` asc
select * from `colors` order by `name` asc
---
    public function edit(Product $product): View
    {
        $product->load(['images', 'variants']);

        $initialVariants = $product->variants->map(function ($variant) {
            return [
                'size_id' => (string) $variant->size_id,
                'color_id' => (string) $variant->color_id,
                'stock_quantity' => (int) $variant->stock_quantity,
                'additional_price' => (float) $variant->additional_price,
            ];
        })->values()->all();

        $selectedSizes = collect($initialVariants)->pluck('size_id')->unique()->values()->all();
        $selectedColors = collect($initialVariants)->pluck('color_id')->unique()->values()->all();

        return view('admin.products.edit', [
            'product' => $product,
            'categoryOptions' => $this->buildCategoryOptions(),
            'brands' => Brand::active()->orderBy('name')->get(),
            'sizes' => Size::orderBy('id')->get(),
            'colors' => Color::orderBy('name')->get(),

delete from `product_variants` where `product_variants`.`product_id` = 4 and `product_variants`.`product_id` is not null
insert into `product_variants` (`size_id`, `color_id`, `stock_quantity`, `additional_price`, `product_id`, `updated_at`, `created_at`) values ('1', '1', 0, 0, 4, '2026-04-12 17:31:29', '2026-04-12 17:31:29')
---
    private function syncVariants(Product $product, array $variants): void
    {
        $unique = [];
        $cleanRows = [];

        foreach ($variants as $row) {
            $key = $row['size_id'] . '-' . $row['color_id'];
            if (isset($unique[$key])) {
                continue;
            }

            $unique[$key] = true;
            $cleanRows[] = [
                'size_id' => $row['size_id'],
                'color_id' => $row['color_id'],
                'stock_quantity' => (int) ($row['stock_quantity'] ?? 0),
                'additional_price' => (float) ($row['additional_price'] ?? 0),
            ];
        }

        $product->variants()->delete();
        $product->variants()->createMany($cleanRows);

insert into `product_images` (`product_id`, `image_path`, `sort_order`, `is_primary`, `updated_at`, `created_at`) values (4, 'products/28c64c4b-bc95-435d-bcdf-ac6d50e96515.jpg', 1, 1, '2026-04-12 17:31:29', '2026-04-12 17:31:29')
---
                Storage::disk('public')->copy($imagePath, $thumbPath);
            }

            ProductImage::create([
                'product_id' => $product->id,
                'image_path' => $imagePath,
                'sort_order' => $sortOrder++,
                'is_primary' => !$hasPrimary,
            ]);

select * from `categories` where `categories`.`parent_id` in (1, 3, 7, 11) order by `sort_order` asc, `sort_order` asc, `name` asc
---
    private function buildCategoryOptions(): array
    {
        $roots = Category::with(['children' => function ($query) {
            $query->orderBy('sort_order')->orderBy('name');
        }])
            ->whereNull('parent_id')
            ->orderBy('sort_order')
            ->orderBy('name')
            ->get();