shop-clothes/app/Http/Controllers/Admin/AdminBrandController.php

    public function store(StoreBrandRequest $request): RedirectResponse
    {
        $data = $request->validated();
        $data['slug'] = $data['slug'] ?: Str::slug($data['name']);

        if ($request->hasFile('logo')) {
            $data['logo'] = $request->file('logo')->store('brands', 'public');
        }

        Brand::create($data);
---
insert into `brands` (`name`, `slug`, `logo`, `description`, `is_active`, `updated_at`, `created_at`) values ('Thời trang nam', 'thanhtttt', 'brands/ySWo8aqrMI8GP2tgMCzQKvYTFrrWHRi7nSI1szMA.jpg', null, 1, '2026-04-12 17:25:01', '2026-04-12 17:25:01')