shop-clothes/app/Http/Controllers/Admin/AdminCategoryController.php

select * from `categories` order by `sort_order` asc, `created_at` desc limit 12 offset 0
select count(*) as aggregate from `categories`
---
    public function index(): View
    {
        $categories = Category::with('parent')
            ->orderBy('sort_order')
            ->orderByDesc('created_at')
            ->paginate(12);

update `categories` set `image` = 'categories/C3efjkKYZTLSbnOyz3SWdqF1xVqRrfSP0vIBze9K.jpg', `is_active` = 1, `categories`.`updated_at` = '2026-04-12 17:24:32' where `id` = 1
---
    public function update(UpdateCategoryRequest $request, Category $category): RedirectResponse
    {
        $data = $request->validated();
        $data['slug'] = $data['slug'] ?: Str::slug($data['name']);

        if ($request->hasFile('image')) {
            if ($category->image) {
                Storage::disk('public')->delete($category->image);
            }

            $data['image'] = $request->file('image')->store('categories', 'public');
        }

        $category->update($data);

select exists(select * from `products` where `products`.`category_id` = 1 and `products`.`category_id` is not null) as `exists`
---
    public function destroy(Category $category): RedirectResponse
    {
        if ($category->products()->exists()) {