shop-clothes/app/Http/Controllers/Admin/AdminAuditLogController.php

select `id`, `name`, `email` from `users` order by `name` asc
---
                'to' => $to,
                'target' => $target,
            ],
            'actors' => User::orderBy('name')->get(['id', 'name', 'email']),