shop-clothes/app/Livewire/AdminProductTable.php

    public function toggleStatus(int $productId): void
    {
        $product = Product::findOrFail($productId);
        $product->update(['is_active' => !$product->is_active]);
---
select * from `products` where `products`.`id` = 4 limit 1
update `products` set `is_active` = 0, `products`.`updated_at` = '2026-04-12 18:05:30' where `id` = 4

    public function render()
    {
        return view('livewire.admin-product-table', [
            'products' => $this->products(),
            'categories' => Category::orderBy('name')->get(),
            'brands' => Brand::orderBy('name')->get(),
---
select * from `categories` order by `name` asc
select * from `brands` order by `name` asc