shop-clothes/app/Livewire/BannerSlider.php

select * from `banners` where `is_active` = 1 and `position` in ('home_top', 'home_middle', 'home_bottom') order by `sort_order` asc
---
    public function mount()
    {
        $this->banners = Banner::where('is_active', true)
            ->whereIn('position', ['home_top', 'home_middle', 'home_bottom'])
            ->orderBy('sort_order')
            ->get()
            ->map(function (Banner $banner) {
                return [
                    'id' => $banner->id,
                    'title' => $banner->title,
                    'subtitle' => 'Khám phá ưu đãi mới nhất từ SportWear Shop',
                    'image_url' => $banner->image_url,
                    'link' => $banner->link ?: '#',
                    'cta_text' => 'Xem ngay',
                ];
            })
            ->values()
            ->toArray();