shop-clothes/app/Livewire/ProductFilter.php

                break;
        }

        return $query->with('category', 'brand', 'colors', 'sizes', 'reviews')
            ->paginate($this->per_page, page: $this->page);
---
select * from `brands` where `brands`.`id` in (1, 2, 3, 4, 5, 6)
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6)

    public function totalProducts()
    {
        return Product::where('is_active', true)
            ->when($this->keyword, function ($q) {
                $q->where(function ($sub) {
                    $sub->where('name', 'like', "%{$this->keyword}%")
                        ->orWhere('description', 'like', "%{$this->keyword}%")
                        ->orWhere('sku', 'like', "%{$this->keyword}%");
                });
            })
            ->when($this->category, function ($q) {
                $q->where('category_id', $this->category)
                    ->orWhereHas('category', function ($sub) {
                        $sub->where('parent_id', $this->category);
                    });
            })
            ->when(!empty($this->brand), function ($q) {
                $q->whereIn('brand_id', $this->brand);
            })
            ->whereBetween('price', [$this->price_min, $this->price_max])
            ->when(!empty($this->size), function ($q) {
                $q->whereHas('sizes', function ($sub) {
                    $sub->whereIn('sizes.id', $this->size);
---
select count(*) as aggregate from `products` where `is_active` = 1 and `price` between 0 and 10000000