shop-clothes/app/Models/Product.php

select avg(`rating`) as aggregate from `reviews` where `reviews`.`product_id` = 5 and `reviews`.`product_id` is not null
---
    public function getAverageRatingAttribute()
    {
        return $this->reviews()->avg('rating') ?? 0;